Repository: bsm00x7/fit_dual
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: Foot Duel App
ar: تطبيق المسابقات

# appSubtitle
source: Test your knowledge, compete, and win
ar: اختبر معلوماتك، نافس، واربح

source: Loading...
ar: جاري التحميل...

# homeTitle
source: Home
ar: الصفحة الرئيسية

# welcome
source: Welcome to the quiz app
ar: مرحباً بك في تطبيق المسابقات

# startJourney
source: Start your journey now!
ar: ابدأ رحلتك الآن!

# startJourneyWithSign
source: Sign in to enjoy the best quizzes
ar: سجل دخولك لتستمتع بأفضل المسابقات

source: Login
ar: تسجيل الدخول

# register
source: Create account
ar: إنشاء حساب

source: Logout
ar: تسجيل الخروج

source: Profile
ar: الملف الشخصي

source: Settings
ar: الإعدادات

source: Yes
ar: نعم

source: No
ar: لا

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Save
ar: حفظ

source: Back
ar: رجوع

# startGame
source: Start playing now!
ar: ابدأ اللعب الآن!

# enterEmail
source: Email address
ar: البريد الإلكتروني

# PleaseEnterEmail
source: Please Enter Your Email
ar: الرجاء إدخال البريد الإلكتروني

source: Password
ar: كلمة المرور

# forgetPassword
source: Forgot password?
ar: نسيت كلمة المرور؟

# enterLogin
source: Login
ar: دخول

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# HaveAccount
source: have an account?
ar: لديك حساب؟

# signUpFree
source: Sign up for free
ar: سجل مجاناً

# firebaseAuthErrorTitle
source: Authentication Error
ar: خطأ في المصادقة

source: Error
ar: خطأ

# userNotFound
source: No user found with this email address.
ar: لا يوجد مستخدم بهذا البريد الإلكتروني.

# wrongPassword
source: Incorrect password. Please try again.
ar: كلمة المرور غير صحيحة. الرجاء المحاولة مرة أخرى.

# invalidEmail
source: The email address is not valid.
ar: عنوان البريد الإلكتروني غير صالح.

# userDisabled
source: This user account has been disabled.
ar: تم تعطيل حساب المستخدم هذا.

# invalidCredential
source: Please check your email and password.
ar: الرجاء التحقق من البريد الإلكتروني وكلمة المرور.

# accountExistsWithDifferentCredential
source: An account already exists with the same email but different sign-in credentials.
ar: يوجد حساب بنفس البريد الإلكتروني بطريقة تسجيل دخول مختلفة.

# emailAlreadyInUse
source: This email address is already registered. Please use a different email or try logging in.
ar: البريد الإلكتروني مسجل مسبقاً. الرجاء استخدام بريد آخر أو تسجيل الدخول.

# weakPassword
source: The password is too weak. Please use a stronger password with at least 6 characters.
ar: كلمة المرور ضعيفة جداً. الرجاء استخدام كلمة مرور أقوى بـ 6 أحرف على الأقل.

# operationNotAllowed
source: This operation is not allowed. Please contact support.
ar: هذه العملية غير مسموح بها. الرجاء التواصل مع الدعم الفني.

# missingEmail
source: Please provide an email address.
ar: الرجاء إدخال البريد الإلكتروني.

# invalidActionCode
source: The password reset link is invalid or has expired. Please request a new one.
ar: رابط إعادة تعيين كلمة المرور غير صالح أو منتهي الصلاحية. الرجاء طلب رابط جديد.

# expiredActionCode
source: The password reset link has expired. Please request a new one.
ar: انتهت صلاحية رابط إعادة تعيين كلمة المرور. الرجاء طلب رابط جديد.

# networkRequestFailed
source: Network error. Please check your internet connection and try again.
ar: خطأ في الشبكة. الرجاء التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

# tooManyRequests
source: Too many unsuccessful attempts. Please try again later.
ar: محاولات كثيرة غير ناجحة. الرجاء المحاولة لاحقاً.

# invalidVerificationCode
source: The verification code is invalid. Please try again.
ar: رمز التحقق غير صالح. الرجاء المحاولة مرة أخرى.

# invalidVerificationId
source: The verification ID is invalid. Please try again.
ar: معرّف التحقق غير صالح. الرجاء المحاولة مرة أخرى.

# sessionExpired
source: Your session has expired. Please try again.
ar: انتهت صلاحية الجلسة. الرجاء المحاولة مرة أخرى.

# invalidPhoneNumber
source: The phone number format is invalid.
ar: صيغة رقم الهاتف غير صالحة.

# missingPhoneNumber
source: Please provide a phone number.
ar: الرجاء إدخال رقم الهاتف.

# quotaExceeded
source: SMS quota exceeded. Please try again later.
ar: تم تجاوز حصة الرسائل النصية. الرجاء المحاولة لاحقاً.

# captchaCheckFailed
source: reCAPTCHA verification failed. Please try again.
ar: فشل التحقق من reCAPTCHA. الرجاء المحاولة مرة أخرى.

# multiFactorAuthRequired
source: Multi-factor authentication is required to complete sign-in.
ar: المصادقة متعددة العوامل مطلوبة لإتمام تسجيل الدخول.

# maximumSecondFactorCountExceeded
source: Maximum number of second factors exceeded.
ar: تم تجاوز الحد الأقصى لعوامل المصادقة الثانوية.

# unsupportedFirstFactor
source: The first factor is not supported.
ar: العامل الأول غير مدعوم.

# requiresRecentLogin
source: This operation requires recent authentication. Please log in again.
ar: تتطلب هذه العملية مصادقة حديثة. الرجاء تسجيل الدخول مرة أخرى.

# providerAlreadyLinked
source: This provider is already linked to your account.
ar: هذا المزود مرتبط بحسابك بالفعل.

# noSuchProvider
source: This provider is not linked to your account.
ar: هذا المزود غير مرتبط بحسابك.

# invalidProviderId
source: The provider ID is invalid.
ar: معرّف المزود غير صالح.

# invalidCustomToken
source: The custom token format is invalid.
ar: صيغة الرمز المخصص غير صالحة.

# customTokenMismatch
source: The custom token does not match the expected format.
ar: الرمز المخصص لا يطابق الصيغة المتوقعة.

# appDeleted
source: The Firebase app has been deleted.
ar: تم حذف تطبيق Firebase.

# appNotAuthorized
source: This app is not authorized to use Firebase Authentication.
ar: هذا التطبيق غير مصرح له باستخدام مصادقة Firebase.

# argumentError
source: Invalid argument provided.
ar: تم تقديم معامل غير صالح.

# credentialAlreadyInUse
source: This credential is already associated with a different user account.
ar: بيانات الاعتماد هذه مرتبطة بحساب مستخدم آخر.

# invalidUserToken
source: The user token is invalid. Please log in again.
ar: رمز المستخدم غير صالح. الرجاء تسجيل الدخول مرة أخرى.

# userTokenExpired
source: Your session has expired. Please log in again.
ar: انتهت صلاحية الجلسة. الرجاء تسجيل الدخول مرة أخرى.

# internalError
source: An internal error occurred. Please try again.
ar: حدث خطأ داخلي. الرجاء المحاولة مرة أخرى.

# timeout
source: The operation has timed out. Please try again.
ar: انتهت مهلة العملية. الرجاء المحاولة مرة أخرى.

source: Missing client identifier.
ar: معرّف العميل مفقود.

# missingContinueUri
source: A continue URL must be provided.
ar: يجب تقديم رابط المتابعة.

# unauthorizedContinueUri
source: The continue URL is not authorized.
ar: رابط المتابعة غير مصرح به.

# invalidContinueUri
source: The continue URL provided is invalid.
ar: رابط المتابعة المقدم غير صالح.

source: Missing iOS bundle ID.
ar: معرّف حزمة iOS مفقود.

# missingAndroidPkgName
source: Missing Android package name.
ar: اسم حزمة Android مفقود.

# adminRestrictedOperation
source: This operation is restricted to administrators only.
ar: هذه العملية مقتصرة على المسؤولين فقط.

# popupBlocked
source: The popup was blocked by the browser. Please allow popups for this site.
ar: تم حظر النافذة المنبثقة بواسطة المتصفح. الرجاء السماح بالنوافذ المنبثقة لهذا الموقع.

# popupClosedByUser
source: The popup was closed before completing the sign-in.
ar: تم إغلاق النافذة المنبثقة قبل إتمام تسجيل الدخول.

# unauthorizedDomain
source: This domain is not authorized for OAuth operations.
ar: هذا النطاق غير مصرح به لعمليات OAuth.

# webStorageUnsupported
source: Web storage is not supported or disabled.
ar: تخزين الويب غير مدعوم أو معطل.

# cancelledPopupRequest
source: The popup request was cancelled.
ar: تم إلغاء طلب النافذة المنبثقة.

# keychainError
source: An error occurred accessing the keychain.
ar: حدث خطأ أثناء الوصول إلى سلسلة المفاتيح.

# missingIframeStart
source: An internal error occurred with the authentication process.
ar: حدث خطأ داخلي في عملية المصادقة.

# invalidApiKey
source: Invalid API key provided.
ar: تم تقديم مفتاح API غير صالح.

# appNotInstalled
source: The requested mobile application is not installed.
ar: التطبيق المحمول المطلوب غير مثبت.

# unexpectedError
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. الرجاء المحاولة مرة أخرى.

source: Error code
ar: رمز الخطأ

# retryInAnthorTime
source: Try In Anthor time, and Thank You
ar: الرجاء المحولة في وقت لحقا و شكراا

# CreateAccount
source: Create Account Now !
ar: انشئ حسابك الأن !

# JoinUs
source: Join Us For Quiz App
ar: أنضم الينا ة ابدأ التحدي في مسابقاتنا التفاعلية

source: Name User
ar: اسم المستخدم

# ConfirmePassword
source: Confrime Password
ar: تاكيد كلمة المرور

source: Lead Board
ar: الترتيب

source: Quick Play
ar: لعب سريع

# testKnowledge
source: Test your knowledge in a random challenge
ar: اختبر معلوماتك في تحدي عشوائي

source: Start Now
ar: ابدأ الآن

source: Daily Questions
ar: أسئلة يومية

source: New Prizes
ar: جوائز جديدة

source: Challenge Player
ar: تحدي لاعب

# competeWithFriends
source: Compete with your friends
ar: نافس أصدقائك

source: Top Players
ar: المتصدرين

source: View All
ar: عرض الكل

source: Level
ar: مستوى

source: Points
ar: نقطة

source: Hello
ar: أهلاً
